use crate::char::{Char, CharPool};
use crate::transliterator::{
    TransliterationError, Transliterator, TransliteratorFactory, TransliteratorFactoryError,
};
use crate::transliterators::SimpleTransliterator;
static RADICALS_MAPPINGS: phf::Map<&'static str, &'static str> = phf::phf_map! { "⽏" => "毋" , "⽖" => "爪" , "⽠" => "瓜" , "⿀" => "鬲" , "⼶" => "廾" , "⻋" => "车" , "⻒" => "镸" , "⼚" => "厂" , "⽬" => "目" , "⾻" => "骨" , "⺋" => "㔾" , "⼪" => "尢" , "⽐" => "比" , "⾐" => "衣" , "⻉" => "贝" , "⾇" => "舛" , "⺢" => "氺" , "⿑" => "齊" , "⾉" => "艮" , "⽲" => "禾" , "⻭" => "歯" , "⿂" => "魚" , "⾍" => "虫" , "⾫" => "隹" , "⼊" => "入" , "⾖" => "豆" , "⼰" => "己" , "⺳" => "㓁" , "⾼" => "高" , "⼈" => "人" , "⻩" => "黄" , "⻃" => "覀" , "⾭" => "靑" , "⿕" => "龠" , "⻂" => "衤" , "⻣" => "骨" , "⾷" => "食" , "⺗" => "㣺" , "⾱" => "韋" , "⾥" => "里" , "⾊" => "色" , "⻫" => "斉" , "⻜" => "飞" , "⿁" => "鬼" , "⼴" => "广" , "⻀" => "艹" , "⽯" => "石" , "⺰" => "纟" , "⼽" => "戈" , "⽣" => "生" , "⽌" => "止" , "⺃" => "乚" , "⾔" => "言" , "⼇" => "亠" , "⼐" => "凵" , "⾮" => "非" , "⼷" => "弋" , "⺟" => "母" , "⻨" => "麦" , "⿏" => "鼠" , "⻮" => "齿" , "⺡" => "氵" , "⼗" => "十" , "⻢" => "马" , "⽮" => "矢" , "⽅" => "方" , "⻙" => "韦" , "⻬" => "齐" , "⼛" => "厶" , "⼦" => "子" , "⼻" => "彳" , "⻪" => "黾" , "⿋" => "黹" , "⾑" => "襾" , "⻰" => "龙" , "⽙" => "爿" , "⽉" => "月" , "⻈" => "讠" , "⻥" => "鱼" , "⽺" => "羊" , "⼠" => "士" , "⻛" => "风" , "⺽" => "臼" , "⽴" => "立" , "⽚" => "片" , "⾞" => "車" , "⿒" => "齒" , "⾩" => "阜" , "⿔" => "龜" , "⺏" => "尣" , "⺦" => "丬" , "⼝" => "口" , "⽘" => "爻" , "⼃" => "丿" , "⼭" => "山" , "⽾" => "耒" , "⻝" => "食" , "⼸" => "弓" , "⽞" => "玄" , "⽗" => "父" , "⾽" => "髟" , "⿃" => "鳥" , "⻅" => "见" , "⼀" => "一" , "⼍" => "冖" , "⾚" => "赤" , "⽃" => "斗" , "⽛" => "牙" , "⺘" => "扌" , "⻍" => "辶" , "⼱" => "巾" , "⾝" => "身" , "⼣" => "夕" , "⽁" => "攴" , "⾹" => "香" , "⾺" => "馬" , "⾧" => "長" , "⾏" => "行" , "⽎" => "殳" , "⾪" => "隶" , "⾰" => "革" , "⾋" => "艸" , "⾛" => "走" , "⾗" => "豕" , "⾄" => "至" , "⾁" => "肉" , "⾃" => "自" , "⽧" => "疒" , "⻤" => "鬼" , "⽊" => "木" , "⼺" => "彡" , "⼎" => "冫" , "⼥" => "女" , "⺥" => "爫" , "⽦" => "疋" , "⺾" => "艹" , "⺠" => "民" , "⼋" => "八" , "⽭" => "矛" , "⺄" => "乙" , "⺀" => "冫" , "⼒" => "力" , "⽆" => "无" , "⽩" => "白" , "⻳" => "龟" , "⿊" => "黑" , "⻧" => "卤" , "⼨" => "寸" , "⺱" => "罓" , "⾦" => "金" , "⾵" => "風" , "⽥" => "田" , "⼾" => "戶" , "⼘" => "卜" , "⽝" => "犬" , "⼑" => "刀" , "⾤" => "釆" , "⽈" => "曰" , "⽒" => "氏" , "⼬" => "屮" , "⾟" => "辛" , "⼂" => "丶" , "⽟" => "玉" , "⽰" => "示" , "⾀" => "聿" , "⾲" => "韭" , "⾿" => "鬯" , "⺐" => "尢" , "⼼" => "心" , "⺛" => "旡" , "⽻" => "羽" , "⼉" => "儿" , "⺺" => "肀" , "⺿" => "艹" , "⽕" => "火" , "⽇" => "日" , "⻘" => "青" , "⺭" => "礻" , "⻯" => "竜" , "⼞" => "囗" , "⽸" => "缶" , "⺂" => "乛" , "⺁" => "厂" , "⺆" => "冂" , "⽼" => "老" , "⼵" => "廴" , "⾅" => "臼" , "⺅" => "亻" , "⾳" => "音" , "⾘" => "豸" , "⽋" => "欠" , "⽱" => "禸" , "⼧" => "宀" , "⽵" => "竹" , "⾬" => "雨" , "⼔" => "匕" , "⿄" => "鹵" , "⿇" => "麻" , "⿍" => "鼎" , "⾓" => "角" , "⺬" => "示" , "⻐" => "钅" , "⻟" => "飠" , "⻖" => "阝" , "⿎" => "鼓" , "⻑" => "長" , "⻦" => "鸟" , "⽍" => "歹" , "⺼" => "月" , "⽽" => "而" , "⾌" => "虍" , "⾙" => "貝" , "⺕" => "彐" , "⼄" => "乙" , "⾶" => "飛" , "⽶" => "米" , "⺹" => "耂" , "⻏" => "阝" , "⼤" => "大" , "⼏" => "几" , "⻠" => "饣" , "⽀" => "支" , "⺨" => "犭" , "⾜" => "足" , "⾯" => "面" , "⽫" => "皿" , "⼟" => "土" , "⾈" => "舟" , "⿓" => "龍" , "⺉" => "刂" , "⻁" => "虎" , "⽪" => "皮" , "⼙" => "卩" , "⺝" => "月" , "⻱" => "龜" , "⼌" => "冂" , "⼯" => "工" , "⽨" => "癶" , "⺎" => "兀" , "⼆" => "二" , "⿉" => "黍" , "⼫" => "尸" , "⺯" => "糹" , "⺓" => "幺" , "⺙" => "攵" , "⼕" => "匚" , "⼲" => "干" , "⽂" => "文" , "⾆" => "舌" , "⿈" => "黃" , "⾢" => "邑" , "⻓" => "长" , "⺖" => "忄" , "⼮" => "巛" , "⽓" => "气" , "⽹" => "网" , "⾒" => "見" , "⽡" => "瓦" , "⽑" => "毛" , "⻚" => "页" , "⻲" => "亀" , "⼓" => "勹" , "⽤" => "用" , "⽢" => "甘" , "⾸" => "首" , "⺞" => "歺" , "⼅" => "亅" , "⺫" => "罒" , "⾡" => "辵" , "⾣" => "酉" , "⽳" => "穴" , "⼢" => "夊" , "⼿" => "手" , "⽜" => "牛" , "⼜" => "又" , "⺔" => "彑" , "⿐" => "鼻" , "⽷" => "糸" , "⼁" => "丨" , "⾨" => "門" , "⺴" => "㓁" , "⾂" => "臣" , "⻄" => "西" , "⾴" => "頁" , "⼖" => "匸" , "⺣" => "灬" , "⼡" => "夂" , "⽄" => "斤" , "⼹" => "彐" , "⺒" => "巳" , "⿅" => "鹿" , "⿌" => "黽" , "⼳" => "幺" , "⺊" => "卜" , "⽔" => "水" , "⽿" => "耳" , "⾠" => "辰" , "⾾" => "鬥" , "⼩" => "小" , "⿆" => "麥" , "⾕" => "谷" , "⾎" => "血" };
pub struct RadicalsTransliterator {
    inner: SimpleTransliterator,
}
impl RadicalsTransliterator {
    #[allow(clippy::new_without_default)]
    pub fn new() -> Self {
        Self {
            inner: SimpleTransliterator::new(&RADICALS_MAPPINGS),
        }
    }
}
impl Transliterator for RadicalsTransliterator {
    fn transliterate<'a, 'b>(
        &self,
        pool: &mut CharPool<'a, 'b>,
        input: &[&'a Char<'a, 'b>],
    ) -> Result<Vec<&'a Char<'a, 'b>>, TransliterationError> {
        self.inner.transliterate(pool, input)
    }
}
pub struct RadicalsTransliteratorFactory;
impl RadicalsTransliteratorFactory {
    #[allow(clippy::new_without_default)]
    pub fn new() -> Self {
        Self
    }
}
impl TransliteratorFactory for RadicalsTransliteratorFactory {
    fn new_transliterator(&self) -> Result<Box<dyn Transliterator>, TransliteratorFactoryError> {
        Ok(Box::new(RadicalsTransliterator::new()))
    }
}
