use crate::char::{Char, CharPool};
use crate::transliterator::{
    TransliterationError, Transliterator, TransliteratorFactory, TransliteratorFactoryError,
};
use crate::transliterators::SimpleTransliterator;
static RADICALS_MAPPINGS: phf::Map<&'static str, &'static str> = phf::phf_map! { "⺘" => "扌" , "⾎" => "血" , "⼋" => "八" , "⽲" => "禾" , "⽸" => "缶" , "⽦" => "疋" , "⻖" => "阝" , "⼳" => "幺" , "⽨" => "癶" , "⽪" => "皮" , "⿔" => "龜" , "⼹" => "彐" , "⺳" => "㓁" , "⻉" => "贝" , "⻦" => "鸟" , "⽉" => "月" , "⽷" => "糸" , "⺀" => "冫" , "⾄" => "至" , "⾦" => "金" , "⻛" => "风" , "⽍" => "歹" , "⼌" => "冂" , "⾫" => "隹" , "⼘" => "卜" , "⾰" => "革" , "⻋" => "车" , "⽼" => "老" , "⼪" => "尢" , "⽎" => "殳" , "⼶" => "廾" , "⼨" => "寸" , "⿕" => "龠" , "⽌" => "止" , "⾐" => "衣" , "⾵" => "風" , "⼠" => "士" , "⺕" => "彐" , "⽃" => "斗" , "⼁" => "丨" , "⾑" => "襾" , "⼫" => "尸" , "⾣" => "酉" , "⺅" => "亻" , "⺄" => "乙" , "⺛" => "旡" , "⻙" => "韦" , "⻧" => "卤" , "⼮" => "巛" , "⾖" => "豆" , "⺺" => "肀" , "⻏" => "阝" , "⿍" => "鼎" , "⽘" => "爻" , "⻤" => "鬼" , "⺊" => "卜" , "⽚" => "片" , "⺆" => "冂" , "⼀" => "一" , "⾍" => "虫" , "⽔" => "水" , "⼞" => "囗" , "⽯" => "石" , "⼲" => "干" , "⼖" => "匸" , "⾠" => "辰" , "⺒" => "巳" , "⼾" => "戶" , "⾃" => "自" , "⽕" => "火" , "⾬" => "雨" , "⺬" => "示" , "⻁" => "虎" , "⻐" => "钅" , "⻠" => "饣" , "⿎" => "鼓" , "⻯" => "竜" , "⻟" => "飠" , "⾛" => "走" , "⽒" => "氏" , "⾴" => "頁" , "⼵" => "廴" , "⽏" => "毋" , "⼧" => "宀" , "⾒" => "見" , "⽄" => "斤" , "⽗" => "父" , "⿂" => "魚" , "⾢" => "邑" , "⽭" => "矛" , "⽖" => "爪" , "⻲" => "亀" , "⼸" => "弓" , "⼄" => "乙" , "⾈" => "舟" , "⾧" => "長" , "⻨" => "麦" , "⻬" => "齐" , "⾜" => "足" , "⾹" => "香" , "⽫" => "皿" , "⺫" => "罒" , "⺟" => "母" , "⺎" => "兀" , "⻒" => "镸" , "⼩" => "小" , "⼟" => "土" , "⽝" => "犬" , "⾪" => "隶" , "⽺" => "羊" , "⾾" => "鬥" , "⻑" => "長" , "⻃" => "覀" , "⾝" => "身" , "⾱" => "韋" , "⻣" => "骨" , "⺰" => "纟" , "⾿" => "鬯" , "⽠" => "瓜" , "⾤" => "釆" , "⾇" => "舛" , "⿑" => "齊" , "⽐" => "比" , "⽅" => "方" , "⿄" => "鹵" , "⼽" => "戈" , "⺠" => "民" , "⾷" => "食" , "⼈" => "人" , "⺓" => "幺" , "⼆" => "二" , "⿊" => "黑" , "⺝" => "月" , "⼼" => "心" , "⺡" => "氵" , "⺣" => "灬" , "⻢" => "马" , "⼏" => "几" , "⿀" => "鬲" , "⿉" => "黍" , "⼂" => "丶" , "⽆" => "无" , "⾲" => "韭" , "⼦" => "子" , "⾓" => "角" , "⽹" => "网" , "⼜" => "又" , "⾕" => "谷" , "⿁" => "鬼" , "⼊" => "入" , "⾨" => "門" , "⽜" => "牛" , "⽱" => "禸" , "⺽" => "臼" , "⿃" => "鳥" , "⽞" => "玄" , "⿇" => "麻" , "⽶" => "米" , "⾘" => "豸" , "⾼" => "高" , "⼗" => "十" , "⻂" => "衤" , "⻜" => "飞" , "⼉" => "儿" , "⾆" => "舌" , "⺏" => "尣" , "⿒" => "齒" , "⼷" => "弋" , "⼍" => "冖" , "⽇" => "日" , "⽓" => "气" , "⽣" => "生" , "⿐" => "鼻" , "⻚" => "页" , "⽑" => "毛" , "⺱" => "罓" , "⺥" => "爫" , "⻝" => "食" , "⺗" => "㣺" , "⺃" => "乚" , "⼅" => "亅" , "⺢" => "氺" , "⼱" => "巾" , "⾯" => "面" , "⼣" => "夕" , "⾸" => "首" , "⾡" => "辵" , "⻫" => "斉" , "⾔" => "言" , "⺐" => "尢" , "⾌" => "虍" , "⾮" => "非" , "⽡" => "瓦" , "⻱" => "龜" , "⾊" => "色" , "⺞" => "歺" , "⻰" => "龙" , "⾏" => "行" , "⼝" => "口" , "⾩" => "阜" , "⺂" => "乛" , "⾀" => "聿" , "⾂" => "臣" , "⼕" => "匚" , "⾶" => "飛" , "⿋" => "黹" , "⾳" => "音" , "⺿" => "艹" , "⻄" => "西" , "⾅" => "臼" , "⿓" => "龍" , "⺔" => "彑" , "⽬" => "目" , "⿅" => "鹿" , "⼛" => "厶" , "⾗" => "豕" , "⼇" => "亠" , "⼐" => "凵" , "⽿" => "耳" , "⺭" => "礻" , "⺾" => "艹" , "⻭" => "歯" , "⼬" => "屮" , "⿈" => "黃" , "⺦" => "丬" , "⻥" => "鱼" , "⽻" => "羽" , "⾚" => "赤" , "⽧" => "疒" , "⽊" => "木" , "⽛" => "牙" , "⼒" => "力" , "⽽" => "而" , "⼥" => "女" , "⽾" => "耒" , "⾥" => "里" , "⺋" => "㔾" , "⺨" => "犭" , "⻍" => "辶" , "⽈" => "曰" , "⽳" => "穴" , "⺉" => "刂" , "⻈" => "讠" , "⽂" => "文" , "⾋" => "艸" , "⽵" => "竹" , "⾁" => "肉" , "⽩" => "白" , "⻩" => "黄" , "⾺" => "馬" , "⺼" => "月" , "⼔" => "匕" , "⾞" => "車" , "⼯" => "工" , "⼰" => "己" , "⿌" => "黽" , "⼚" => "厂" , "⿆" => "麥" , "⻘" => "青" , "⼭" => "山" , "⻓" => "长" , "⽰" => "示" , "⼎" => "冫" , "⻪" => "黾" , "⽀" => "支" , "⽮" => "矢" , "⽙" => "爿" , "⾽" => "髟" , "⾉" => "艮" , "⼙" => "卩" , "⽢" => "甘" , "⽤" => "用" , "⻅" => "见" , "⺖" => "忄" , "⾙" => "貝" , "⽥" => "田" , "⼓" => "勹" , "⼤" => "大" , "⽋" => "欠" , "⽟" => "玉" , "⿏" => "鼠" , "⼃" => "丿" , "⼺" => "彡" , "⼿" => "手" , "⺙" => "攵" , "⺹" => "耂" , "⻀" => "艹" , "⻮" => "齿" , "⾭" => "靑" , "⽴" => "立" , "⾻" => "骨" , "⽁" => "攴" , "⼑" => "刀" , "⾟" => "辛" , "⺴" => "㓁" , "⼻" => "彳" , "⻳" => "龟" , "⺯" => "糹" , "⼴" => "广" , "⼡" => "夂" , "⺁" => "厂" , "⼢" => "夊" };
pub struct RadicalsTransliterator {
    inner: SimpleTransliterator,
}
impl RadicalsTransliterator {
    #[allow(clippy::new_without_default)]
    pub fn new() -> Self {
        Self {
            inner: SimpleTransliterator::new(&RADICALS_MAPPINGS),
        }
    }
}
impl Transliterator for RadicalsTransliterator {
    fn transliterate<'a, 'b>(
        &self,
        pool: &mut CharPool<'a, 'b>,
        input: &[&'a Char<'a, 'b>],
    ) -> Result<Vec<&'a Char<'a, 'b>>, TransliterationError> {
        self.inner.transliterate(pool, input)
    }
}
pub struct RadicalsTransliteratorFactory;
impl RadicalsTransliteratorFactory {
    #[allow(clippy::new_without_default)]
    pub fn new() -> Self {
        Self
    }
}
impl TransliteratorFactory for RadicalsTransliteratorFactory {
    fn new_transliterator(&self) -> Result<Box<dyn Transliterator>, TransliteratorFactoryError> {
        Ok(Box::new(RadicalsTransliterator::new()))
    }
}
