use crate::char::{Char, CharPool};
use crate::transliterator::{
    TransliterationError, Transliterator, TransliteratorFactory, TransliteratorFactoryError,
};
use crate::transliterators::SimpleTransliterator;
static RADICALS_MAPPINGS: phf::Map<&'static str, &'static str> = phf::phf_map! { "⿃" => "鳥" , "⼵" => "廴" , "⼶" => "廾" , "⽐" => "比" , "⼽" => "戈" , "⼰" => "己" , "⺫" => "罒" , "⺁" => "厂" , "⾐" => "衣" , "⺏" => "尣" , "⾮" => "非" , "⽈" => "曰" , "⿒" => "齒" , "⾅" => "臼" , "⾉" => "艮" , "⾿" => "鬯" , "⾀" => "聿" , "⻟" => "飠" , "⽍" => "歹" , "⾥" => "里" , "⼧" => "宀" , "⽖" => "爪" , "⽲" => "禾" , "⻒" => "镸" , "⺙" => "攵" , "⾹" => "香" , "⽤" => "用" , "⼙" => "卩" , "⽏" => "毋" , "⿌" => "黽" , "⽒" => "氏" , "⺽" => "臼" , "⾱" => "韋" , "⽼" => "老" , "⺳" => "㓁" , "⼸" => "弓" , "⾾" => "鬥" , "⿐" => "鼻" , "⾞" => "車" , "⺴" => "㓁" , "⻠" => "饣" , "⾏" => "行" , "⾭" => "靑" , "⻰" => "龙" , "⿈" => "黃" , "⾧" => "長" , "⿎" => "鼓" , "⾵" => "風" , "⿔" => "龜" , "⻝" => "食" , "⼣" => "夕" , "⽞" => "玄" , "⺆" => "冂" , "⻦" => "鸟" , "⻣" => "骨" , "⼋" => "八" , "⼻" => "彳" , "⽄" => "斤" , "⺘" => "扌" , "⻈" => "讠" , "⼅" => "亅" , "⼝" => "口" , "⼗" => "十" , "⽕" => "火" , "⾪" => "隶" , "⺉" => "刂" , "⽩" => "白" , "⾠" => "辰" , "⼪" => "尢" , "⽊" => "木" , "⻢" => "马" , "⿅" => "鹿" , "⼛" => "厶" , "⿁" => "鬼" , "⽰" => "示" , "⾯" => "面" , "⽋" => "欠" , "⽀" => "支" , "⾘" => "豸" , "⻚" => "页" , "⼹" => "彐" , "⽯" => "石" , "⺝" => "月" , "⼭" => "山" , "⼇" => "亠" , "⼉" => "儿" , "⺟" => "母" , "⽡" => "瓦" , "⻏" => "阝" , "⽶" => "米" , "⼯" => "工" , "⺛" => "旡" , "⼜" => "又" , "⽹" => "网" , "⾍" => "虫" , "⿇" => "麻" , "⻫" => "斉" , "⻳" => "龟" , "⺥" => "爫" , "⼮" => "巛" , "⼎" => "冫" , "⾫" => "隹" , "⺣" => "灬" , "⾽" => "髟" , "⺢" => "氺" , "⾛" => "走" , "⼦" => "子" , "⺞" => "歺" , "⺡" => "氵" , "⻧" => "卤" , "⽇" => "日" , "⼱" => "巾" , "⻪" => "黾" , "⿑" => "齊" , "⺾" => "艹" , "⻩" => "黄" , "⻥" => "鱼" , "⾔" => "言" , "⻯" => "竜" , "⺱" => "罓" , "⺿" => "艹" , "⼍" => "冖" , "⾡" => "辵" , "⻙" => "韦" , "⽧" => "疒" , "⼖" => "匸" , "⻛" => "风" , "⾳" => "音" , "⼥" => "女" , "⽥" => "田" , "⽙" => "爿" , "⺖" => "忄" , "⺦" => "丬" , "⻬" => "齐" , "⽚" => "片" , "⾒" => "見" , "⽷" => "糸" , "⾇" => "舛" , "⾨" => "門" , "⼷" => "弋" , "⼐" => "凵" , "⽑" => "毛" , "⿂" => "魚" , "⽾" => "耒" , "⽃" => "斗" , "⼘" => "卜" , "⾸" => "首" , "⽿" => "耳" , "⾻" => "骨" , "⼨" => "寸" , "⼆" => "二" , "⽵" => "竹" , "⻄" => "西" , "⻓" => "长" , "⼴" => "广" , "⼞" => "囗" , "⾁" => "肉" , "⼕" => "匚" , "⾺" => "馬" , "⼀" => "一" , "⼡" => "夂" , "⾜" => "足" , "⽂" => "文" , "⿕" => "龠" , "⾗" => "豕" , "⾖" => "豆" , "⽠" => "瓜" , "⼂" => "丶" , "⽱" => "禸" , "⾝" => "身" , "⽺" => "羊" , "⾼" => "高" , "⿄" => "鹵" , "⾴" => "頁" , "⾤" => "釆" , "⿊" => "黑" , "⼏" => "几" , "⻀" => "艹" , "⻘" => "青" , "⽪" => "皮" , "⻭" => "歯" , "⾚" => "赤" , "⼿" => "手" , "⾓" => "角" , "⺊" => "卜" , "⽽" => "而" , "⻍" => "辶" , "⾎" => "血" , "⽗" => "父" , "⽓" => "气" , "⽟" => "玉" , "⼔" => "匕" , "⼃" => "丿" , "⽎" => "殳" , "⾑" => "襾" , "⺼" => "月" , "⽨" => "癶" , "⾃" => "自" , "⾢" => "邑" , "⾩" => "阜" , "⺠" => "民" , "⻅" => "见" , "⿉" => "黍" , "⼳" => "幺" , "⽸" => "缶" , "⾄" => "至" , "⼟" => "土" , "⾕" => "谷" , "⾶" => "飛" , "⼺" => "彡" , "⺅" => "亻" , "⺨" => "犭" , "⺔" => "彑" , "⻋" => "车" , "⻲" => "亀" , "⾬" => "雨" , "⺂" => "乛" , "⺄" => "乙" , "⼄" => "乙" , "⽢" => "甘" , "⺹" => "耂" , "⽝" => "犬" , "⼌" => "冂" , "⿓" => "龍" , "⽛" => "牙" , "⽴" => "立" , "⼬" => "屮" , "⽜" => "牛" , "⺰" => "纟" , "⽦" => "疋" , "⽌" => "止" , "⼼" => "心" , "⼊" => "入" , "⾷" => "食" , "⿆" => "麥" , "⻂" => "衤" , "⾣" => "酉" , "⻤" => "鬼" , "⽆" => "无" , "⾲" => "韭" , "⼓" => "勹" , "⼠" => "士" , "⽳" => "穴" , "⾋" => "艸" , "⽣" => "生" , "⺎" => "兀" , "⼲" => "干" , "⾟" => "辛" , "⽭" => "矛" , "⾆" => "舌" , "⺃" => "乚" , "⺋" => "㔾" , "⺒" => "巳" , "⻜" => "飞" , "⻑" => "長" , "⻨" => "麦" , "⻖" => "阝" , "⾈" => "舟" , "⽬" => "目" , "⿏" => "鼠" , "⾰" => "革" , "⽔" => "水" , "⾊" => "色" , "⼁" => "丨" , "⽅" => "方" , "⺕" => "彐" , "⼈" => "人" , "⺗" => "㣺" , "⻐" => "钅" , "⺐" => "尢" , "⺓" => "幺" , "⻁" => "虎" , "⼚" => "厂" , "⻃" => "覀" , "⽫" => "皿" , "⽮" => "矢" , "⻮" => "齿" , "⻱" => "龜" , "⺯" => "糹" , "⼫" => "尸" , "⼾" => "戶" , "⾌" => "虍" , "⿋" => "黹" , "⺬" => "示" , "⼤" => "大" , "⿀" => "鬲" , "⾙" => "貝" , "⾂" => "臣" , "⺀" => "冫" , "⾦" => "金" , "⼩" => "小" , "⽘" => "爻" , "⽻" => "羽" , "⼒" => "力" , "⿍" => "鼎" , "⻉" => "贝" , "⼢" => "夊" , "⼑" => "刀" , "⽁" => "攴" , "⽉" => "月" , "⺺" => "肀" , "⺭" => "礻" };
pub struct RadicalsTransliterator {
    inner: SimpleTransliterator,
}
impl RadicalsTransliterator {
    #[allow(clippy::new_without_default)]
    pub fn new() -> Self {
        Self {
            inner: SimpleTransliterator::new(&RADICALS_MAPPINGS),
        }
    }
}
impl Transliterator for RadicalsTransliterator {
    fn transliterate<'a, 'b>(
        &self,
        pool: &mut CharPool<'a, 'b>,
        input: &[&'a Char<'a, 'b>],
    ) -> Result<Vec<&'a Char<'a, 'b>>, TransliterationError> {
        self.inner.transliterate(pool, input)
    }
}
pub struct RadicalsTransliteratorFactory;
impl RadicalsTransliteratorFactory {
    #[allow(clippy::new_without_default)]
    pub fn new() -> Self {
        Self
    }
}
impl TransliteratorFactory for RadicalsTransliteratorFactory {
    fn new_transliterator(&self) -> Result<Box<dyn Transliterator>, TransliteratorFactoryError> {
        Ok(Box::new(RadicalsTransliterator::new()))
    }
}
