use crate::char::{Char, CharPool};
use crate::transliterator::{
    TransliterationError, Transliterator, TransliteratorFactory, TransliteratorFactoryError,
};
use crate::transliterators::SimpleTransliterator;
static RADICALS_MAPPINGS: phf::Map<&'static str, &'static str> = phf::phf_map! { "⼘" => "卜" , "⽇" => "日" , "⽻" => "羽" , "⽠" => "瓜" , "⻚" => "页" , "⻫" => "斉" , "⾕" => "谷" , "⼋" => "八" , "⾾" => "鬥" , "⻖" => "阝" , "⽉" => "月" , "⾈" => "舟" , "⽷" => "糸" , "⻟" => "飠" , "⼊" => "入" , "⾋" => "艸" , "⻧" => "卤" , "⽮" => "矢" , "⼙" => "卩" , "⻂" => "衤" , "⾓" => "角" , "⺝" => "月" , "⽃" => "斗" , "⻪" => "黾" , "⼑" => "刀" , "⼏" => "几" , "⻛" => "风" , "⼈" => "人" , "⺼" => "月" , "⽁" => "攴" , "⽊" => "木" , "⿆" => "麥" , "⿈" => "黃" , "⺿" => "艹" , "⻑" => "長" , "⼱" => "巾" , "⺥" => "爫" , "⽂" => "文" , "⽿" => "耳" , "⾤" => "釆" , "⼢" => "夊" , "⾵" => "風" , "⼅" => "亅" , "⾩" => "阜" , "⽕" => "火" , "⾍" => "虫" , "⽝" => "犬" , "⼌" => "冂" , "⽙" => "爿" , "⾰" => "革" , "⾼" => "高" , "⻐" => "钅" , "⾦" => "金" , "⽦" => "疋" , "⾽" => "髟" , "⼷" => "弋" , "⾪" => "隶" , "⾷" => "食" , "⿅" => "鹿" , "⿇" => "麻" , "⼄" => "乙" , "⼻" => "彳" , "⼁" => "丨" , "⾂" => "臣" , "⾎" => "血" , "⽓" => "气" , "⽈" => "曰" , "⾔" => "言" , "⾲" => "韭" , "⺭" => "礻" , "⾐" => "衣" , "⺫" => "罒" , "⻲" => "亀" , "⽵" => "竹" , "⽱" => "禸" , "⾝" => "身" , "⺟" => "母" , "⾯" => "面" , "⺾" => "艹" , "⽘" => "爻" , "⼍" => "冖" , "⾳" => "音" , "⼳" => "幺" , "⼒" => "力" , "⽗" => "父" , "⼃" => "丿" , "⼮" => "巛" , "⽰" => "示" , "⽹" => "网" , "⾛" => "走" , "⽌" => "止" , "⼼" => "心" , "⽭" => "矛" , "⾴" => "頁" , "⽏" => "毋" , "⻬" => "齐" , "⺹" => "耂" , "⽽" => "而" , "⿂" => "魚" , "⽜" => "牛" , "⼣" => "夕" , "⻨" => "麦" , "⾟" => "辛" , "⻳" => "龟" , "⾙" => "貝" , "⽧" => "疒" , "⼠" => "士" , "⻃" => "覀" , "⼜" => "又" , "⽟" => "玉" , "⾘" => "豸" , "⾫" => "隹" , "⼿" => "手" , "⽖" => "爪" , "⾜" => "足" , "⺐" => "尢" , "⼛" => "厶" , "⿐" => "鼻" , "⻀" => "艹" , "⾄" => "至" , "⺱" => "罓" , "⿊" => "黑" , "⼇" => "亠" , "⻢" => "马" , "⾇" => "舛" , "⼤" => "大" , "⿍" => "鼎" , "⾑" => "襾" , "⽯" => "石" , "⾀" => "聿" , "⿁" => "鬼" , "⽍" => "歹" , "⺠" => "民" , "⾻" => "骨" , "⺁" => "厂" , "⼆" => "二" , "⼾" => "戶" , "⺀" => "冫" , "⺽" => "臼" , "⾧" => "長" , "⺎" => "兀" , "⼝" => "口" , "⾮" => "非" , "⼰" => "己" , "⼩" => "小" , "⿒" => "齒" , "⻤" => "鬼" , "⾖" => "豆" , "⽤" => "用" , "⾃" => "自" , "⺺" => "肀" , "⺣" => "灬" , "⽐" => "比" , "⾠" => "辰" , "⿑" => "齊" , "⺘" => "扌" , "⻁" => "虎" , "⻈" => "讠" , "⿃" => "鳥" , "⿓" => "龍" , "⻋" => "车" , "⺆" => "冂" , "⻍" => "辶" , "⺛" => "旡" , "⽑" => "毛" , "⺗" => "㣺" , "⽨" => "癶" , "⻓" => "长" , "⻣" => "骨" , "⻭" => "歯" , "⾞" => "車" , "⾸" => "首" , "⻯" => "竜" , "⼸" => "弓" , "⻘" => "青" , "⺴" => "㓁" , "⿏" => "鼠" , "⾆" => "舌" , "⾏" => "行" , "⻉" => "贝" , "⺯" => "糹" , "⺏" => "尣" , "⿌" => "黽" , "⺙" => "攵" , "⼔" => "匕" , "⾨" => "門" , "⼽" => "戈" , "⻠" => "饣" , "⿔" => "龜" , "⾺" => "馬" , "⼉" => "儿" , "⻱" => "龜" , "⾁" => "肉" , "⼨" => "寸" , "⾥" => "里" , "⼦" => "子" , "⾿" => "鬯" , "⽎" => "殳" , "⽅" => "方" , "⻄" => "西" , "⾢" => "邑" , "⼭" => "山" , "⽪" => "皮" , "⿄" => "鹵" , "⼓" => "勹" , "⼎" => "冫" , "⽩" => "白" , "⼯" => "工" , "⾣" => "酉" , "⼪" => "尢" , "⺞" => "歺" , "⽆" => "无" , "⾶" => "飛" , "⺓" => "幺" , "⾉" => "艮" , "⼵" => "廴" , "⽫" => "皿" , "⺂" => "乛" , "⽞" => "玄" , "⿀" => "鬲" , "⾊" => "色" , "⾹" => "香" , "⺰" => "纟" , "⺳" => "㓁" , "⽶" => "米" , "⼫" => "尸" , "⽒" => "氏" , "⺅" => "亻" , "⽲" => "禾" , "⼲" => "干" , "⽥" => "田" , "⽳" => "穴" , "⺢" => "氺" , "⼕" => "匚" , "⺖" => "忄" , "⽺" => "羊" , "⺡" => "氵" , "⻩" => "黄" , "⼗" => "十" , "⼂" => "丶" , "⽋" => "欠" , "⼬" => "屮" , "⻏" => "阝" , "⺒" => "巳" , "⾅" => "臼" , "⿋" => "黹" , "⼥" => "女" , "⽬" => "目" , "⽡" => "瓦" , "⻜" => "飞" , "⽄" => "斤" , "⼀" => "一" , "⽛" => "牙" , "⻝" => "食" , "⾱" => "韋" , "⻮" => "齿" , "⻰" => "龙" , "⺔" => "彑" , "⾗" => "豕" , "⽚" => "片" , "⽔" => "水" , "⼞" => "囗" , "⺦" => "丬" , "⿕" => "龠" , "⻙" => "韦" , "⺃" => "乚" , "⻅" => "见" , "⺋" => "㔾" , "⽼" => "老" , "⼖" => "匸" , "⼶" => "廾" , "⼐" => "凵" , "⼹" => "彐" , "⺉" => "刂" , "⽀" => "支" , "⾌" => "虍" , "⼺" => "彡" , "⽣" => "生" , "⽴" => "立" , "⾡" => "辵" , "⾚" => "赤" , "⿎" => "鼓" , "⺄" => "乙" , "⺊" => "卜" , "⺕" => "彐" , "⾭" => "靑" , "⿉" => "黍" , "⾒" => "見" , "⾬" => "雨" , "⽾" => "耒" , "⼴" => "广" , "⻒" => "镸" , "⺨" => "犭" , "⺬" => "示" , "⻥" => "鱼" , "⼚" => "厂" , "⼡" => "夂" , "⽢" => "甘" , "⻦" => "鸟" , "⼟" => "土" , "⽸" => "缶" , "⼧" => "宀" };
pub struct RadicalsTransliterator {
    inner: SimpleTransliterator,
}
impl RadicalsTransliterator {
    #[allow(clippy::new_without_default)]
    pub fn new() -> Self {
        Self {
            inner: SimpleTransliterator::new(&RADICALS_MAPPINGS),
        }
    }
}
impl Transliterator for RadicalsTransliterator {
    fn transliterate<'a, 'b>(
        &self,
        pool: &mut CharPool<'a, 'b>,
        input: &[&'a Char<'a, 'b>],
    ) -> Result<Vec<&'a Char<'a, 'b>>, TransliterationError> {
        self.inner.transliterate(pool, input)
    }
}
pub struct RadicalsTransliteratorFactory;
impl RadicalsTransliteratorFactory {
    #[allow(clippy::new_without_default)]
    pub fn new() -> Self {
        Self
    }
}
impl TransliteratorFactory for RadicalsTransliteratorFactory {
    fn new_transliterator(&self) -> Result<Box<dyn Transliterator>, TransliteratorFactoryError> {
        Ok(Box::new(RadicalsTransliterator::new()))
    }
}
