use crate::char::{Char, CharPool};
use crate::transliterator::{
    TransliterationError, Transliterator, TransliteratorFactory, TransliteratorFactoryError,
};
use crate::transliterators::SimpleTransliterator;
static RADICALS_MAPPINGS: phf::Map<&'static str, &'static str> = phf::phf_map! { "⼲" => "干" , "⽊" => "木" , "⺭" => "礻" , "⿀" => "鬲" , "⽔" => "水" , "⿁" => "鬼" , "⿔" => "龜" , "⿉" => "黍" , "⻀" => "艹" , "⽢" => "甘" , "⿓" => "龍" , "⾨" => "門" , "⺴" => "㓁" , "⽜" => "牛" , "⾑" => "襾" , "⾩" => "阜" , "⼃" => "丿" , "⼻" => "彳" , "⽄" => "斤" , "⽵" => "竹" , "⾬" => "雨" , "⼥" => "女" , "⽨" => "癶" , "⻧" => "卤" , "⺹" => "耂" , "⼁" => "丨" , "⻙" => "韦" , "⼆" => "二" , "⾙" => "貝" , "⻲" => "亀" , "⼟" => "土" , "⼘" => "卜" , "⼸" => "弓" , "⼰" => "己" , "⿈" => "黃" , "⿊" => "黑" , "⽇" => "日" , "⿏" => "鼠" , "⾣" => "酉" , "⽥" => "田" , "⽪" => "皮" , "⾻" => "骨" , "⺫" => "罒" , "⽋" => "欠" , "⾐" => "衣" , "⺓" => "幺" , "⺗" => "㣺" , "⼇" => "亠" , "⻋" => "车" , "⾃" => "自" , "⺋" => "㔾" , "⽈" => "曰" , "⺺" => "肀" , "⻪" => "黾" , "⺉" => "刂" , "⾱" => "韋" , "⺡" => "氵" , "⺎" => "兀" , "⼨" => "寸" , "⻭" => "歯" , "⼱" => "巾" , "⽽" => "而" , "⼪" => "尢" , "⼒" => "力" , "⾥" => "里" , "⼦" => "子" , "⼠" => "士" , "⾤" => "釆" , "⺦" => "丬" , "⿂" => "魚" , "⽲" => "禾" , "⾘" => "豸" , "⻮" => "齿" , "⽖" => "爪" , "⼎" => "冫" , "⻖" => "阝" , "⿃" => "鳥" , "⿐" => "鼻" , "⼈" => "人" , "⽆" => "无" , "⽌" => "止" , "⽒" => "氏" , "⽺" => "羊" , "⾴" => "頁" , "⿎" => "鼓" , "⺏" => "尣" , "⺒" => "巳" , "⺙" => "攵" , "⺘" => "扌" , "⼐" => "凵" , "⾌" => "虍" , "⿌" => "黽" , "⾟" => "辛" , "⼌" => "冂" , "⼤" => "大" , "⼚" => "厂" , "⻱" => "龜" , "⿕" => "龠" , "⺐" => "尢" , "⼳" => "幺" , "⺥" => "爫" , "⺃" => "乚" , "⻬" => "齐" , "⾶" => "飛" , "⾯" => "面" , "⾔" => "言" , "⽡" => "瓦" , "⼛" => "厶" , "⻐" => "钅" , "⺛" => "旡" , "⾕" => "谷" , "⻁" => "虎" , "⻑" => "長" , "⻅" => "见" , "⺼" => "月" , "⾸" => "首" , "⾇" => "舛" , "⼾" => "戶" , "⾠" => "辰" , "⺀" => "冫" , "⽯" => "石" , "⼴" => "广" , "⿒" => "齒" , "⼢" => "夊" , "⾹" => "香" , "⺁" => "厂" , "⺊" => "卜" , "⽮" => "矢" , "⼕" => "匚" , "⽶" => "米" , "⾵" => "風" , "⽕" => "火" , "⾿" => "鬯" , "⽿" => "耳" , "⾡" => "辵" , "⿋" => "黹" , "⼋" => "八" , "⽳" => "穴" , "⼂" => "丶" , "⼄" => "乙" , "⾏" => "行" , "⾢" => "邑" , "⺰" => "纟" , "⼙" => "卩" , "⽠" => "瓜" , "⽤" => "用" , "⽴" => "立" , "⻓" => "长" , "⾎" => "血" , "⼉" => "儿" , "⽟" => "玉" , "⼼" => "心" , "⾼" => "高" , "⾳" => "音" , "⽩" => "白" , "⼯" => "工" , "⿆" => "麥" , "⽬" => "目" , "⺳" => "㓁" , "⽸" => "缶" , "⾂" => "臣" , "⼅" => "亅" , "⻰" => "龙" , "⽐" => "比" , "⺱" => "罓" , "⻜" => "飞" , "⼶" => "廾" , "⼍" => "冖" , "⼿" => "手" , "⽁" => "攴" , "⽚" => "片" , "⺕" => "彐" , "⾁" => "肉" , "⾦" => "金" , "⻳" => "龟" , "⾛" => "走" , "⻢" => "马" , "⻥" => "鱼" , "⻨" => "麦" , "⼫" => "尸" , "⾪" => "隶" , "⺢" => "氺" , "⽰" => "示" , "⽀" => "支" , "⾍" => "虫" , "⼏" => "几" , "⾄" => "至" , "⻦" => "鸟" , "⺽" => "臼" , "⽓" => "气" , "⺬" => "示" , "⻠" => "饣" , "⻯" => "竜" , "⼹" => "彐" , "⽗" => "父" , "⺄" => "乙" , "⻩" => "黄" , "⼀" => "一" , "⽘" => "爻" , "⽧" => "疒" , "⼭" => "山" , "⽃" => "斗" , "⾝" => "身" , "⺖" => "忄" , "⻣" => "骨" , "⽾" => "耒" , "⽭" => "矛" , "⺨" => "犭" , "⽼" => "老" , "⼓" => "勹" , "⺝" => "月" , "⼺" => "彡" , "⼑" => "刀" , "⽝" => "犬" , "⾾" => "鬥" , "⼧" => "宀" , "⽏" => "毋" , "⻟" => "飠" , "⼵" => "廴" , "⼣" => "夕" , "⾲" => "韭" , "⻤" => "鬼" , "⽱" => "禸" , "⿅" => "鹿" , "⻄" => "西" , "⾚" => "赤" , "⽎" => "殳" , "⽛" => "牙" , "⾷" => "食" , "⺆" => "冂" , "⼬" => "屮" , "⽞" => "玄" , "⽂" => "文" , "⾆" => "舌" , "⾖" => "豆" , "⾮" => "非" , "⾺" => "馬" , "⺟" => "母" , "⺣" => "灬" , "⺅" => "亻" , "⽙" => "爿" , "⼖" => "匸" , "⺯" => "糹" , "⻍" => "辶" , "⺔" => "彑" , "⽫" => "皿" , "⼞" => "囗" , "⼊" => "入" , "⾭" => "靑" , "⻘" => "青" , "⻉" => "贝" , "⼝" => "口" , "⾧" => "長" , "⾜" => "足" , "⻚" => "页" , "⿇" => "麻" , "⿑" => "齊" , "⾋" => "艸" , "⾉" => "艮" , "⽣" => "生" , "⼷" => "弋" , "⽍" => "歹" , "⽉" => "月" , "⼗" => "十" , "⾅" => "臼" , "⾊" => "色" , "⻏" => "阝" , "⻒" => "镸" , "⼽" => "戈" , "⻛" => "风" , "⽑" => "毛" , "⾈" => "舟" , "⺂" => "乛" , "⻈" => "讠" , "⼡" => "夂" , "⾒" => "見" , "⺞" => "歺" , "⺿" => "艹" , "⻝" => "食" , "⿄" => "鹵" , "⺾" => "艹" , "⾓" => "角" , "⼔" => "匕" , "⾞" => "車" , "⽦" => "疋" , "⻫" => "斉" , "⽹" => "网" , "⽷" => "糸" , "⻃" => "覀" , "⼩" => "小" , "⼜" => "又" , "⺠" => "民" , "⾫" => "隹" , "⿍" => "鼎" , "⾽" => "髟" , "⾀" => "聿" , "⻂" => "衤" , "⾗" => "豕" , "⼮" => "巛" , "⾰" => "革" , "⽻" => "羽" , "⽅" => "方" };
pub struct RadicalsTransliterator {
    inner: SimpleTransliterator,
}
impl RadicalsTransliterator {
    #[allow(clippy::new_without_default)]
    pub fn new() -> Self {
        Self {
            inner: SimpleTransliterator::new(&RADICALS_MAPPINGS),
        }
    }
}
impl Transliterator for RadicalsTransliterator {
    fn transliterate<'a, 'b>(
        &self,
        pool: &mut CharPool<'a, 'b>,
        input: &[&'a Char<'a, 'b>],
    ) -> Result<Vec<&'a Char<'a, 'b>>, TransliterationError> {
        self.inner.transliterate(pool, input)
    }
}
pub struct RadicalsTransliteratorFactory;
impl RadicalsTransliteratorFactory {
    #[allow(clippy::new_without_default)]
    pub fn new() -> Self {
        Self
    }
}
impl TransliteratorFactory for RadicalsTransliteratorFactory {
    fn new_transliterator(&self) -> Result<Box<dyn Transliterator>, TransliteratorFactoryError> {
        Ok(Box::new(RadicalsTransliterator::new()))
    }
}
